---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.UndefinedSpaces
source: html/bb0635dd-ed39-feea-a060-0981d43e880d.htm
---
# Autodesk.Revit.DB.BuiltInFailures.EnergyAnalysisFailures.UndefinedSpaces Property

There are undefined Spaces in the model! Recommend creating a Space schedule and checking the Area parameter of each Space for warnings.

## Syntax (C#)
```csharp
public static FailureDefinitionId UndefinedSpaces { get; }
```